ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC0_0.0.xml
        </group>
    <register id="HSADC0_ADCCTL1_LITE_" width="32" offset="0x1000" description="ADC Control 1 Register">
        <bitfield id="INTPULSEPOS" description="ADC Interrupt Pulse Position. #br# #br#  0  Interrupt  pulse generation occurs when ADC begins conversion (at the end of the acquisition window) plus a number of SYSCLK cycles as specified in the ADCINTCYCLE.OFFSET register. #br#  1  Interrupt pulse generation occurs at the end of the conversion, 1 cycle prior to the ADC result latching into its result register" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ADCPWDNZ" description="ADC Power Down (active low). This bit controls the power up and power down of all the analog circuitry inside the analog core. #br# #br#  0  All analog circuitry inside the core is powered down #br#  1  All analog circuitry inside the core is powered up" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ADCBSYCHN" description="ADC Busy Channel. Set when an ADC Start of Conversion (SOC) is generated. #br#When ADCBSY=0: holds the value of the last converted SOC #br#When ADCBSY=1: reflects the SOC currently being processed #br#  0h  SOC0 is currently processing or was last SOC converted #br#  1h  SOC1 is currently processing or was last SOC converted #br#  2h  SOC2 is currently processing or was last SOC converted #br#  3h  SOC3 is currently processing or was last SOC converted #br#  4h  SOC4 is currently processing or was last SOC converted #br#  5h  SOC5 is currently processing or was last SOC converted #br#  6h  SOC6 is currently processing or was last SOC converted #br#  7h  SOC7 is currently processing or was last SOC converted #br#  8h  SOC8 is currently processing or was last SOC converted #br#  9h  SOC9 is currently processing or was last SOC converted #br#  Ah  SOC10 is currently processing or was last SOC converted #br#  Bh  SOC11 is currently processing or was last SOC converted #br#  Ch  SOC12 is currently processing or was last SOC converted #br#  Dh  SOC13 is currently processing or was last SOC converted #br#  Eh  SOC14 is currently processing or was last SOC converted #br#  Fh  SOC15 is currently processing or was last SOC converted" begin="11" end="8" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="ADCBSY" description="ADC Busy. Set when ADC SOC is generated, cleared by hardware four ADC clocks after negative edge of S/H pulse. Used by the ADC state machine to determine if ADC is available to sample. #br# #br#  0  ADC is available to sample next channel #br#  1  ADC is busy and cannot sample another channel" begin="13" end="13" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCCTL2_LITE_" width="32" offset="0x1004" description="ADC Control 2 Register">
        <bitfield id="PRESCALE" description="ADC Clock Prescaler. #br#  0000  ADCCLK = Input Clock / 1.0 #br#  0001  ADCCLK = Input Clock / 1.5 #br#  0010  ADCCLK = Input Clock / 2.0 #br#  0011  ADCCLK = Input Clock / 2.5 #br#  0100  ADCCLK = Input Clock / 3.0 #br#  0101  ADCCLK = Input Clock / 3.5 #br#  0110  ADCCLK = Input Clock / 4.0 #br#  0111  ADCCLK = Input Clock / 4.5 #br#  1000  ADCCLK = Input Clock / 5.0 #br#  1001  ADCCLK = Input Clock / 5.5 #br#  1010  ADCCLK = Input Clock / 6.0 #br#  1011  ADCCLK = Input Clock / 6.5 #br#  1100  ADCCLK = Input Clock / 7.0 #br#  1101  ADCCLK = Input Clock / 7.5 #br#  1110  ADCCLK = Input Clock / 8.0 #br#  1111  ADCCLK = Input Clock / 8.5" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="RESOLUTION" description="SOC Conversion Resolution. Selects the resolution of the converter. Use the AdcSetMode function to change the resolution. #br#  0  12-bit resolution #br#  1  16-bit resolution" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SIGNALMODE" description="SOC Signaling Mode. Selects the input mode of the converter. Use the AdcSetMode function to change the signal mode. #br#  0  Single-ended #br#  1  Differential" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DEBUGMODE" description="ADC Clocking Mode. Selects the number of ADCCLK pulses to be generated to the converter. #br#  0  Default mode - Generate only sufficient number of clocks based on Resolution and Sample Cap reset. #br#  1  Debug mode - Generate 2 additional ADCCLK pulses for every conversion." begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCBURSTCTL_LITE_" width="32" offset="0x100C" description="ADC Burst Control Register">
        <bitfield id="BURSTTRIGSEL" description="SOC Burst Trigger Source Select. Configures which trigger will start a burst conversion sequence. #br# #br#Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration. #br#  00h  BURSTTRIG0 - Software only #br#  01h - 3Fh - Hardware Triggers" begin="4" end="0" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="BURSTSIZE" description="SOC Burst Size Select. This bit field determines how many SOCs are converted when a burst conversion sequence is started. The first SOC converted is defined by the round robin pointer, which is advanced as each SOC is converted. #br# #br#  0h  1 SOC converted #br#  1h  2 SOCs converted #br#  2h  3 SOCs converted #br#  3h  4 SOCs converted #br#  4h  5 SOCs converted #br#  5h  6 SOCs converted #br#  6h  7 SOCs converted #br#  7h  8 SOCs converted #br#  8h  9 SOCs converted #br#  9h  10 SOCs converted #br#  Ah  11 SOCs converted #br#  Bh  12 SOCs converted #br#  Ch  13 SOCs converted #br#  Dh  14 SOCs converted #br#  Eh  15 SOCs converted #br#  Fh  16 SOCs converted" begin="11" end="8" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="BURSTEN" description="SOC Burst Mode Enable. This bit enables the SOC Burst Mode of operation. #br# #br#  0  Burst mode is disabled. #br#  1  Burst mode is enabled." begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCINTSEL_M33_" width="32" offset="0x1010" description="ADC Interrupt 1, 2, 3 and 4 Selection Register">
        <bitfield id="INT1SEL" description="ADCINT1 EOC Source Select #br#  00h  EOC0 is trigger for ADCINT1 #br#  01h  EOC1 is trigger for ADCINT1 #br#  02h  EOC2 is trigger for ADCINT1 #br#  03h  EOC3 is trigger for ADCINT1 #br#  04h  EOC4 is trigger for ADCINT1 #br#  05h  EOC5 is trigger for ADCINT1 #br#  06h  EOC6 is trigger for ADCINT1 #br#  07h  EOC7 is trigger for ADCINT1 #br#  08h  EOC8 is trigger for ADCINT1 #br#  09h  EOC9 is trigger for ADCINT1 #br#  0Ah  EOC10 is trigger for ADCINT1 #br#  0Bh  EOC11 is trigger for ADCINT1 #br#  0Ch  EOC12 is trigger for ADCINT1 #br#  0Dh  EOC13 is trigger for ADCINT1 #br#  0Eh  EOC14 is trigger for ADCINT1 #br#  0Fh  EOC15 is trigger for ADCINT1 #br# #br#Note : When oversampling is enabled, the end of the last oversampled coversion will trigger the interrupts #br#" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="INT1CONT" description="ADCINT1 Continue to Interrupt Mode #br#  0  No further ADCINT1 pulses are generated until ADCINT1 flag (in ADCINTFLG register) is cleared by user. #br#  1  ADCINT1 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="INT1E" description="ADCINT1 Interrupt Enable #br#  0  ADCINT1 is disabled #br#  1  ADCINT1 is enabled" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="INT2SEL" description="ADCINT2 EOC Source Select #br#  00h  EOC0 is trigger for ADCINT2 #br#  01h  EOC1 is trigger for ADCINT2 #br#  02h  EOC2 is trigger for ADCINT2 #br#  03h  EOC3 is trigger for ADCINT2 #br#  04h  EOC4 is trigger for ADCINT2 #br#  05h  EOC5 is trigger for ADCINT2 #br#  06h  EOC6 is trigger for ADCINT2 #br#  07h  EOC7 is trigger for ADCINT2 #br#  08h  EOC8 is trigger for ADCINT2 #br#  09h  EOC9 is trigger for ADCINT2 #br#  0Ah  EOC10 is trigger for ADCINT2 #br#  0Bh  EOC11 is trigger for ADCINT2 #br#  0Ch  EOC12 is trigger for ADCINT2 #br#  0Dh  EOC13 is trigger for ADCINT2 #br#  0Eh  EOC14 is trigger for ADCINT2 #br#  0Fh  EOC15 is trigger for ADCINT2 #br# #br#Note : When oversampling is enabled, the end of the last oversampled coversion will trigger the interrupts #br#" begin="11" end="8" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="INT2CONT" description="ADCINT2 Continue to Interrupt Mode #br#  0  No further ADCINT2 pulses are generated until ADCINT2 flag (in ADCINTFLG register) is cleared by user. #br#  1  ADCINT2 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="INT2E" description="ADCINT2 Interrupt Enable #br#  0  ADCINT2 is disabled #br#  1  ADCINT2 is enabled" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="INT3SEL" description="ADCINT3 EOC Source Select #br#  00h  EOC0 is trigger for ADCINT3 #br#  01h  EOC1 is trigger for ADCINT3 #br#  02h  EOC2 is trigger for ADCINT3 #br#  03h  EOC3 is trigger for ADCINT3 #br#  04h  EOC4 is trigger for ADCINT3 #br#  05h  EOC5 is trigger for ADCINT3 #br#  06h  EOC6 is trigger for ADCINT3 #br#  07h  EOC7 is trigger for ADCINT3 #br#  08h  EOC8 is trigger for ADCINT3 #br#  09h  EOC9 is trigger for ADCINT3 #br#  0Ah  EOC10 is trigger for ADCINT3 #br#  0Bh  EOC11 is trigger for ADCINT3 #br#  0Ch  EOC12 is trigger for ADCINT3 #br#  0Dh  EOC13 is trigger for ADCINT3 #br#  0Eh  EOC14 is trigger for ADCINT3 #br#  0Fh  EOC15 is trigger for ADCINT3 #br# #br#Note : When oversampling is enabled, the end of the last oversampled coversion will trigger the interrupts #br#" begin="19" end="16" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="INT3CONT" description="ADCINT3 Continue to Interrupt Mode #br#  0  No further ADCINT3 pulses are generated until ADCINT3 flag (in ADCINTFLG register) is cleared by user. #br#  1  ADCINT3 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="INT3E" description="ADCINT3 Interrupt Enable #br#  0  ADCINT3 is disabled #br#  1  ADCINT3 is enabled" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="INT4SEL" description="ADCINT4 EOC Source Select #br#  00h  EOC0 is trigger for ADCINT4 #br#  01h  EOC1 is trigger for ADCINT4 #br#  02h  EOC2 is trigger for ADCINT4 #br#  03h  EOC3 is trigger for ADCINT4 #br#  04h  EOC4 is trigger for ADCINT4 #br#  05h  EOC5 is trigger for ADCINT4 #br#  06h  EOC6 is trigger for ADCINT4 #br#  07h  EOC7 is trigger for ADCINT4 #br#  08h  EOC8 is trigger for ADCINT4 #br#  09h  EOC9 is trigger for ADCINT4 #br#  0Ah  EOC10 is trigger for ADCINT4 #br#  0Bh  EOC11 is trigger for ADCINT4 #br#  0Ch  EOC12 is trigger for ADCINT4 #br#  0Dh  EOC13 is trigger for ADCINT4 #br#  0Eh  EOC14 is trigger for ADCINT4 #br#  0Fh  EOC15 is trigger for ADCINT4 #br# #br#Note : When oversampling is enabled, the end of the last oversampled coversion will trigger the interrupts #br#" begin="27" end="24" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="INT4CONT" description="ADCINT4 Continue to Interrupt Mode #br#  0  No further ADCINT4 pulses are generated until ADCINT4 flag (in ADCINTFLG register) is cleared by user. #br#  1  ADCINT4 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="INT4E" description="ADCINT4 Interrupt Enable #br#  0  ADCINT4 is disabled #br#  1  ADCINT4 is enabled" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCDMAINTSEL_M33_" width="32" offset="0x1014" description="ADC DMA Interrupt 1, 2, 3 and 4 Selection Register">
        <bitfield id="DMAINT1SEL" description="ADCDMAINT1 EOC Source Select #br#  00h  EOC0 is trigger for ADCDMAINT1 #br#  01h  EOC1 is trigger for ADCDMAINT1 #br#  02h  EOC2 is trigger for ADCDMAINT1 #br#  03h  EOC3 is trigger for ADCDMAINT1 #br#  04h  EOC4 is trigger for ADCDMAINT1 #br#  05h  EOC5 is trigger for ADCDMAINT1 #br#  06h  EOC6 is trigger for ADCDMAINT1 #br#  07h  EOC7 is trigger for ADCDMAINT1 #br#  08h  EOC8 is trigger for ADCDMAINT1 #br#  09h  EOC9 is trigger for ADCDMAINT1 #br#  0Ah  EOC10 is trigger for ADCDMAINT1 #br#  0Bh  EOC11 is trigger for ADCDMAINT1 #br#  0Ch  EOC12 is trigger for ADCDMAINT1 #br#  0Dh  EOC13 is trigger for ADCDMAINT1 #br#  0Eh  EOC14 is trigger for ADCDMAINT1 #br#  0Fh  EOC15 is trigger for ADCDMAINT1 #br# #br#Note : When oversampling is enabled, the end of the last oversampled conversion will trigger the DMAINTerrupts #br#" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT1CONT" description="ADCDMAINT1 Continue to Interrupt Mode #br#  0  No further ADCDMAINT1 pulses are generated until ADCDMAINT1 flag (in ADCDMAINTFLG register) is cleared by user. #br#  1  ADCDMAINT1 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT1E" description="ADCDMAINT1 Interrupt Enable #br#  0  ADCDMAINT1 is disabled #br#  1  ADCDMAINT1 is enabled" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT2SEL" description="ADCDMAINT2 EOC Source Select #br#  00h  EOC0 is trigger for ADCDMAINT2 #br#  01h  EOC1 is trigger for ADCDMAINT2 #br#  02h  EOC2 is trigger for ADCDMAINT2 #br#  03h  EOC3 is trigger for ADCDMAINT2 #br#  04h  EOC4 is trigger for ADCDMAINT2 #br#  05h  EOC5 is trigger for ADCDMAINT2 #br#  06h  EOC6 is trigger for ADCDMAINT2 #br#  07h  EOC7 is trigger for ADCDMAINT2 #br#  08h  EOC8 is trigger for ADCDMAINT2 #br#  09h  EOC9 is trigger for ADCDMAINT2 #br#  0Ah  EOC10 is trigger for ADCDMAINT2 #br#  0Bh  EOC11 is trigger for ADCDMAINT2 #br#  0Ch  EOC12 is trigger for ADCDMAINT2 #br#  0Dh  EOC13 is trigger for ADCDMAINT2 #br#  0Eh  EOC14 is trigger for ADCDMAINT2 #br#  0Fh  EOC15 is trigger for ADCDMAINT2 #br# #br#Note : When oversampling is enabled, the end of the last oversampled coversion will trigger the DMAINTerrupts #br#" begin="11" end="8" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT2CONT" description="ADCDMAINT2 Continue to Interrupt Mode #br#  0  No further ADCDMAINT2 pulses are generated until ADCDMAINT2 flag (in ADCDMAINTFLG register) is cleared by user. #br#  1  ADCDMAINT2 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT2E" description="ADCDMAINT2 Interrupt Enable #br#  0  ADCDMAINT2 is disabled #br#  1  ADCDMAINT2 is enabled" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT3SEL" description="ADCDMAINT3 EOC Source Select #br#  00h  EOC0 is trigger for ADCDMAINT3 #br#  01h  EOC1 is trigger for ADCDMAINT3 #br#  02h  EOC2 is trigger for ADCDMAINT3 #br#  03h  EOC3 is trigger for ADCDMAINT3 #br#  04h  EOC4 is trigger for ADCDMAINT3 #br#  05h  EOC5 is trigger for ADCDMAINT3 #br#  06h  EOC6 is trigger for ADCDMAINT3 #br#  07h  EOC7 is trigger for ADCDMAINT3 #br#  08h  EOC8 is trigger for ADCDMAINT3 #br#  09h  EOC9 is trigger for ADCDMAINT3 #br#  0Ah  EOC10 is trigger for ADCDMAINT3 #br#  0Bh  EOC11 is trigger for ADCDMAINT3 #br#  0Ch  EOC12 is trigger for ADCDMAINT3 #br#  0Dh  EOC13 is trigger for ADCDMAINT3 #br#  0Eh  EOC14 is trigger for ADCDMAINT3 #br#  0Fh  EOC15 is trigger for ADCDMAINT3 #br# #br#Note : When oversampling is enabled, the end of the last oversampled coversion will trigger the DMAINTerrupts #br#" begin="19" end="16" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT3CONT" description="ADCDMAINT3 Continue to Interrupt Mode #br#  0  No further ADCDMAINT3 pulses are generated until ADCDMAINT3 flag (in ADCDMAINTFLG register) is cleared by user. #br#  1  ADCDMAINT3 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT3E" description="ADCDMAINT3 Interrupt Enable #br#  0  ADCDMAINT3 is disabled #br#  1  ADCDMAINT3 is enabled" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT4SEL" description="ADCDMAINT4 EOC Source Select #br#  00h  EOC0 is trigger for ADCDMAINT4 #br#  01h  EOC1 is trigger for ADCDMAINT4 #br#  02h  EOC2 is trigger for ADCDMAINT4 #br#  03h  EOC3 is trigger for ADCDMAINT4 #br#  04h  EOC4 is trigger for ADCDMAINT4 #br#  05h  EOC5 is trigger for ADCDMAINT4 #br#  06h  EOC6 is trigger for ADCDMAINT4 #br#  07h  EOC7 is trigger for ADCDMAINT4 #br#  08h  EOC8 is trigger for ADCDMAINT4 #br#  09h  EOC9 is trigger for ADCDMAINT4 #br#  0Ah  EOC10 is trigger for ADCDMAINT4 #br#  0Bh  EOC11 is trigger for ADCDMAINT4 #br#  0Ch  EOC12 is trigger for ADCDMAINT4 #br#  0Dh  EOC13 is trigger for ADCDMAINT4 #br#  0Eh  EOC14 is trigger for ADCDMAINT4 #br#  0Fh  EOC15 is trigger for ADCDMAINT4 #br# #br#Note : When oversampling is enabled, the end of the last oversampled coversion will trigger the DMAINTerrupts #br#" begin="27" end="24" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT4CONT" description="ADCDMAINT4 Continue to Interrupt Mode #br#  0  No further ADCDMAINT4 pulses are generated until ADCDMAINT4 flag (in ADCDMAINTFLG register) is cleared by user. #br#  1  ADCDMAINT4 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMAINT4E" description="ADCDMAINT4 Interrupt Enable #br#  0  ADCDMAINT4 is disabled #br#  1  ADCDMAINT4 is enabled" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCRAWINTFLG_4INT" width="32" offset="0x1018" description="ADC Raw Interrupt Flag Register">
        <bitfield id="ADCRAWINT1" description="ADC RAW Interrupt 1 Flag. Reading these flags indicates if the associated INT condition occurred. This flag will be set irrespective of corresponding INTE setting #br# #br#  0  Selected EOC/OSINT event did not occur #br#  1  Selected EOC/OSINT event occurred #br# #br#Writing corresponding INTCLR bit in ADCINTFLGCLR register will clear this bit." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCRAWINT2" description="ADC RAW Interrupt 2 Flag. Reading these flags indicates if the associated INT condition occurred. This flag will be set irrespective of corresponding INTE setting #br# #br#  0  Selected EOC/OSINT event did not occur #br#  1  Selected EOC/OSINT event occured #br# #br#Writing corresponding INTCLR bit in ADCINTFLGCLR register will clear this bit." begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCRAWINT3" description="ADC RAW Interrupt 3 Flag. Reading these flags indicates if the associated INT condition occurred. This flag will be set irrespective of corresponding INTE setting #br# #br#  0  Selected EOC/OSINT event did not occur #br#  1  Selected EOC/OSINT event occured #br# #br#Writing corresponding INTCLR bit in ADCINTFLGCLR register will clear this bit." begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCRAWINT4" description="ADC RAW Interrupt 4 Flag. Reading these flags indicates if the associated INT condition occurred. This flag will be set irrespective of corresponding INTE setting #br# #br#  0  Selected EOC/OSINT event did not occur #br#  1  Selected EOC/OSINT event occured #br# #br#Writing corresponding INTCLR bit in ADCINTFLGCLR register will clear this bit." begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCDMARAWINT1" description="ADC DMA Raw Interrupt 1 Flag. Reading these flags indicates if the associated ADCDMAINT condition occurred. This flag will be set irrespective of corresponding DMAINTE setting #br# #br#  0  Selected EOC/OSINT event did not occur #br#  1  Selected EOC/OSINT event occurred #br# #br#Writing corresponding INTCLR bit in ADCINTFLGCLR register will clear this bit." begin="16" end="16" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCDMARAWINT2" description="ADC DMA Raw Interrupt 2 Flag. Reading these flags indicates if the associated ADCDMAINT condition occurred. This flag will be set irrespective of corresponding DMAINTE setting #br# #br#  0  Selected EOC/OSINT event did not occur #br#  1  Selected EOC/OSINT event occurred #br# #br#Writing corresponding INTCLR bit in ADCINTFLGCLR register will clear this bit." begin="17" end="17" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCDMARAWINT3" description="ADC DMA Raw Interrupt 3 Flag. Reading these flags indicates if the associated ADCDMAINT condition occurred. This flag will be set irrespective of corresponding DMAINTE setting #br# #br#  0  Selected EOC/OSINT event did not occur #br#  1  Selected EOC/OSINT event occurred #br# #br#Writing corresponding INTCLR bit in ADCINTFLGCLR register will clear this bit." begin="18" end="18" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCDMARAWINT4" description="ADC DMA Raw Interrupt 4 Flag. Reading these flags indicates if the associated ADCDMAINT condition occurred. This flag will be set irrespective of corresponding DMAINTE setting #br# #br#  0  Selected EOC/OSINT event did not occur #br#  1  Selected EOC/OSINT event occurred #br# #br#Writing corresponding INTCLR bit in ADCINTFLGCLR register will clear this bit." begin="19" end="19" width="1" rwaccess="R">
        </bitfield>
    </register>
