ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC0_0.0.xml
    <register id="HSADC0_ADCINTFLG_4INT" width="32" offset="0x101C" description="ADC Interrupt Flag Register">
        <bitfield id="ADCINT1" description="ADC Interrupt 1 Flag. Reading these flags indicates if the associated ADCINT pulse was generated since the last clear. #br# #br#  0  No ADC interrupt pulse generated #br#  1  ADC interrupt pulse generated #br# #br#If the ADC interrupt is placed in continue to interrupt mode (INTSEL register) then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINTFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCINT2" description="ADC Interrupt 2 Flag. Reading these flags indicates if the associated ADCINT pulse was generated since the last clear. #br# #br#  0  No ADC interrupt pulse generated #br#  1  ADC interrupt pulse generated #br# #br#If the ADC interrupt is placed in continue to interrupt mode (INTSEL register) then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINTFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCINT3" description="ADC Interrupt 3 Flag. Reading these flags indicates if the associated ADCINT pulse was generated since the last clear. #br# #br#  0  No ADC interrupt pulse generated #br#  1  ADC interrupt pulse generated #br# #br#If the ADC interrupt is placed in continue to interrupt mode (INTSEL register) then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINTFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCINT4" description="ADC Interrupt 4 Flag. Reading these flags indicates if the associated ADCINT pulse was generated since the last clear. #br# #br#  0  No ADC interrupt pulse generated #br#  1  ADC interrupt pulse generated #br# #br#If the ADC interrupt is placed in continue to interrupt mode (INTSEL register) then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCINT1RESULT" description="ADC Interrupt 1 Results Ready Flag. This flag is set when the conversions results associated with ADCINT1 latch into the corresponding results register.   #br# #br#  0  Conversion results have not latched #br#  1  Conversion results have latched #br# #br#This flag can be used in an ISR that is entered in early interrupt mode to ensure that the corresponding results are ready before proceeding to read the result register.   #br# #br#This flag can be cleared via the ACK bit in the ADCINTFLGCLR that also clears the ADCINT1 flag.    #br# #br#In case results latch and this flag is already set, the corresponding flag in ADCINTOVF is NOT set.  This flag does NOT have to be cleared in order for ADCINT ISRs to propagate to the PIE.   #br# #br#In case the associated SOC is associated with a PPB or PPBs, the flag will not be set until all associated PPB results latch." begin="8" end="8" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCINT2RESULT" description="ADC Interrupt 2 Results Ready Flag. This flag is set when the conversions results associated with ADCINT2 latch into the corresponding results register.   #br# #br#  0  Conversion results have not latched #br#  1  Conversion results have latched #br# #br#This flag can be used in an ISR that is entered in early interrupt mode to ensure that the corresponding results are ready before proceeding to read the result register.   #br# #br#This flag can be cleared via the ACK bit in the ADCINTFLGCLR that also clears the ADCINT2 flag.    #br# #br#In case results latch and this flag is already set, the corresponding flag in ADCINTOVF is NOT set.  This flag does NOT have to be cleared in order for ADCINT ISRs to propagate to the PIE.   #br# #br#In case the associated SOC is associated with a PPB or PPBs, the flag will not be set until all associated PPB results latch." begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCINT3RESULT" description="ADC Interrupt 3 Results Ready Flag. This flag is set when the conversions results associated with ADCINT3 latch into the corresponding results register.   #br# #br#  0  Conversion results have not latched #br#  1  Conversion results have latched #br# #br#This flag can be used in an ISR that is entered in early interrupt mode to ensure that the corresponding results are ready before proceeding to read the result register.   #br# #br#This flag can be cleared via the ACK bit in the ADCINTFLGCLR that also clears the ADCINT3 flag.    #br# #br#In case results latch and this flag is already set, the corresponding flag in ADCINTOVF is NOT set.  This flag does NOT have to be cleared in order for ADCINT ISRs to propagate to the PIE.   #br# #br#In case the associated SOC is associated with a PPB or PPBs, the flag will not be set until all associated PPB results latch." begin="10" end="10" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCINT4RESULT" description="ADC Interrupt 4 Results Ready Flag. This flag is set when the conversions results associated with ADCINT4 latch into the corresponding results register.   #br# #br#  0  Conversion results have not latched #br#  1  Conversion results have latched #br# #br#This flag can be used in an ISR that is entered in early interrupt mode to ensure that the corresponding results are ready before proceeding to read the result register.   #br# #br#This flag can be cleared via the ACK bit in the ADCINTFLGCLR that also clears the ADCINT4 flag.    #br# #br#In case results latch and this flag is already set, the corresponding flag in ADCINTOVF is NOT set.  This flag does NOT have to be cleared in order for ADCINT ISRs to propagate to the PIE.   #br# #br#In case the associated SOC is associated with a PPB or PPBs, the flag will not be set until all associated PPB results latch." begin="11" end="11" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCDMAINT1" description="ADC DMA Interrupt 1 Flag. Reading these flags indicates if the associated ADCDMAINT pulse was generated since the last clear. #br# #br#  0  No ADC DMA interrupt pulse generated #br#  1  ADC DMA interrupt pulse generated #br# #br#If the ADC interrupt is placed in continue to interrupt mode (DMAINTSEL register) then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINTFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." begin="16" end="16" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCDMAINT2" description="ADC DMA Interrupt 2 Flag. Reading these flags indicates if the associated ADCDMAINT pulse was generated since the last clear. #br# #br#  0  No ADC DMA interrupt pulse generated #br#  1  ADC DMA interrupt pulse generated #br# #br#If the ADC DMA interrupt is placed in continue to interrupt mode (DMAINTSEL register) then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINTFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." begin="17" end="17" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCDMAINT3" description="ADC DMA Interrupt 3 Flag. Reading these flags indicates if the associated ADCDMAINT pulse was generated since the last clear. #br# #br#  0  No ADC DMA interrupt pulse generated #br#  1  ADC DMA interrupt pulse generated #br# #br#If the ADC interrupt is placed in continue to interrupt mode (DMAINTSEL register) then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINTFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." begin="18" end="18" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ADCDMAINT4" description="ADC DMA Interrupt 4 Flag. Reading these flags indicates if the associated ADCDMAINT pulse was generated since the last clear. #br# #br#  0  No ADC DMA interru4pt pulse generated #br#  1  ADC DMA interrupt pulse generated #br# #br#If the ADC interrupt is placed in continue to interrupt mode (DMAINTSEL register) then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINTFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." begin="19" end="19" width="1" rwaccess="R">
        </bitfield>
    </register>
