ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC0_0.0.xml
    <register id="HSADC0_ADCSOC2CTL_M33_" width="32" offset="0x1054" description="ADC SOC2 Control Register">
        <bitfield id="CHSEL" description="SOC2 Channel Select. Selects the channel to be converted when SOC2 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC2 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSOC3CTL_M33_" width="32" offset="0x1058" description="ADC SOC3 Control Register">
        <bitfield id="CHSEL" description="SOC3 Channel Select. Selects the channel to be converted when SOC3 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC3 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSOC4CTL_M33_" width="32" offset="0x105C" description="ADC SOC4 Control Register">
        <bitfield id="CHSEL" description="SOC4 Channel Select. Selects the channel to be converted when SOC4 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC4 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSOC5CTL_M33_" width="32" offset="0x1060" description="ADC SOC5 Control Register">
        <bitfield id="CHSEL" description="SOC5 Channel Select. Selects the channel to be converted when SOC5 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC5 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSOC6CTL_M33_" width="32" offset="0x1064" description="ADC SOC6 Control Register">
        <bitfield id="CHSEL" description="SOC6 Channel Select. Selects the channel to be converted when SOC6 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC6 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSOC7CTL_M33_" width="32" offset="0x1068" description="ADC SOC7 Control Register">
        <bitfield id="CHSEL" description="SOC7 Channel Select. Selects the channel to be converted when SOC7 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC7 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSOC8CTL_M33_" width="32" offset="0x106C" description="ADC SOC8 Control Register">
        <bitfield id="CHSEL" description="SOC8 Channel Select. Selects the channel to be converted when SOC8 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC8 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSOC9CTL_M33_" width="32" offset="0x1070" description="ADC SOC9 Control Register">
        <bitfield id="CHSEL" description="SOC9 Channel Select. Selects the channel to be converted when SOC9 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC9 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSOC10CTL_M33_" width="32" offset="0x1074" description="ADC SOC10 Control Register">
        <bitfield id="CHSEL" description="SOC10 Channel Select. Selects the channel to be converted when SOC10 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC10 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSOC11CTL_M33_" width="32" offset="0x1078" description="ADC SOC11 Control Register">
        <bitfield id="CHSEL" description="SOC11 Channel Select. Selects the channel to be converted when SOC11 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC11 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSOC12CTL_M33_" width="32" offset="0x107C" description="ADC SOC12 Control Register">
        <bitfield id="CHSEL" description="SOC12 Channel Select. Selects the channel to be converted when SOC12 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC12 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSOC13CTL_M33_" width="32" offset="0x1080" description="ADC SOC13 Control Register">
        <bitfield id="CHSEL" description="SOC13 Channel Select. Selects the channel to be converted when SOC13 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC13 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
