ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC0_0.0.xml
    <register id="HSADC0_ADCSOC14CTL_M33_" width="32" offset="0x1084" description="ADC SOC14 Control Register">
        <bitfield id="CHSEL" description="SOC14 Channel Select. Selects the channel to be converted when SOC14 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC14 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSOC15CTL_M33_" width="32" offset="0x1088" description="ADC SOC15 Control Register">
        <bitfield id="CHSEL" description="SOC15 Channel Select. Selects the channel to be converted when SOC15 is received by the ADC. #br#  00h  ADCIN0 #br#  01h  ADCIN1 #br#  02h  ADCIN2 #br#  03h  ADCIN3 #br#  ... #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30 #br#  1Fh  ADCIN31" begin="19" end="15" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="COMPEN" description="SOC15 Threshold comparator enable." begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCEVTSTAT_4PPB_" width="32" offset="0x10CC" description="ADC Event Status Register">
        <bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Flag. When set indicates a digital compare trip high event has occurred. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Flag. When set indicates a digital compare trip low event has occurred. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Flag. When set indicates the ADCPPB1RESULT register has changed sign. This bit is gated by EOC signal. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PPB1INLIMIT" description="Post Processing Block 1 Within trip limit Flag.  When set indicates a digital compare within limit event has occurred. This will be set when the PPB result is either in between or equal to the TRIPHI and TRIPLO thresholds. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Flag. When set indicates a digital compare trip high event has occurred. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="4" end="4" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Flag. When set indicates a digital compare trip low event has occurred. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="5" end="5" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Flag. When set indicates the ADCPPB2RESULT register has changed sign. This bit is gated by EOC signal. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="6" end="6" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PPB2INLIMIT" description="Post Processing Block 2 Within trip limit Flag.  When set indicates a digital compare within limit event has occurred. This will be set when the PPB result is either in between or equal to the TRIPHI and TRIPLO thresholds. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="7" end="7" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Flag. When set indicates a digital compare trip high event has occurred. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="8" end="8" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Flag. When set indicates a digital compare trip low event has occurred. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Flag. When set indicates the ADCPPB3RESULT register has changed sign. This bit is gated by EOC signal. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="10" end="10" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PPB3INLIMIT" description="Post Processing Block 3 Within trip limit Flag.  When set indicates a digital compare within limit event has occurred. This will be set when the PPB result is either in between or equal to the TRIPHI and TRIPLO thresholds. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="11" end="11" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Flag. When set indicates a digital compare trip high event has occurred. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="12" end="12" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Flag. When set indicates a digital compare trip low event has occurred. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="13" end="13" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Flag. When set indicates the ADCPPB4RESULT register has changed sign. This bit is gated by EOC signal. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="14" end="14" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PPB4INLIMIT" description="Post Processing Block 4 Within trip limit Flag.  When set indicates a digital compare within limit event has occurred. This will be set when the PPB result is either in between or equal to the TRIPHI and TRIPLO thresholds. #br# #br#Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="15" end="15" width="1" rwaccess="R">
        </bitfield>
    </register>
