ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC0_0.0.xml
    <register id="HSADC0_ADCEVTCLR_4PPB_" width="32" offset="0x10D0" description="ADC Event Clear Register">
        <bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Clear. Clears the corresponding trip high flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Clear. Clears the corresponding trip low flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Clear. Clears the corresponding zero crossing flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB1INLIMIT" description="Post Processing Block 1 Within trip limit flag Clear, Clears the corresponding within trip limit flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Clear. Clears the corresponding trip high flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Clear. Clears the corresponding trip low flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Clear. Clears the corresponding zero crossing flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2INLIMIT" description="Post Processing Block 2 Within trip limit flag Clear, Clears the corresponding within trip limit flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Clear. Clears the corresponding trip high flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Clear. Clears the corresponding trip low flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Clear. Clears the corresponding zero crossing flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3INLIMIT" description="Post Processing Block 3 Within trip limit flag Clear, Clears the corresponding within trip limit flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Clear. Clears the corresponding trip high flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Clear. Clears the corresponding trip low flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Clear. Clears the corresponding zero crossing flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4INLIMIT" description="Post Processing Block 4 Within trip limit flag Clear, Clears the corresponding within trip limit flag in the ADCEVTSTAT register. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCEVTSEL_4PPB_" width="32" offset="0x10D4" description="ADC Event Selection Register">
        <bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB1INLIMIT" description="Post Processing Block 1 Within trip limit event enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2INLIMIT" description="Post Processing Block 2 Within trip limit event enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3INLIMIT" description="Post Processing Block 3 Within trip limit event enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4INLIMIT" description="Post Processing Block 4 Within trip limit event enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCEVTINTSEL_4PPB_" width="32" offset="0x10D8" description="ADC Event Interrupt Selection Register">
        <bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB1INLIMIT" description="Post Processing Block 1 Within trip limit Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB2INLIMIT" description="Post Processing Block 2 Within trip limit Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB3INLIMIT" description="Post Processing Block 3 Within trip limit Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPB4INLIMIT" description="Post Processing Block 4 Within trip limit Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCOSDETECT_HSADC12B_" width="32" offset="0x10DC" description="ADC Open and Shorts Detect Register">
        <bitfield id="DETECTCFG" description="ADC Opens and Shorts Detect Configuration. This bit field defines the open/shorts detection circuit state. #br# #br#  0h  Open/Shorts detection circuit is disabled. #br#  1h  Open/Shorts detection circuit is enabled at zero scale. #br#  2h  Open/Shorts detection circuit is enabled at full scale. #br#  3h  Open/Shorts detection circuit is enabled at (nominal) 5/12 scale. #br#  4h  Open/Shorts detection circuit is enabled at (nominal) 7/12 scale. #br#  5h  Open/Shorts detection circuit is enabled with a (nominal) 5K pulldown to VSSA. #br#  6h  Open/Shorts detection circuit is enabled with a (nominal) 5K pullup to VDDA. #br#  7h  Open/Shorts detection circuit is enabled with a (nominal) 7K pulldown to VSSA." begin="2" end="0" width="3" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCREV_HSADC12B_" width="32" offset="0x10E4" description="ADC Revision Register">
        <bitfield id="TYPE" description="ADC Type. Always set to 6 for this HSADC-12b." begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="REV" description="ADC Revision. To allow documentation of differences between revisions. First version is labeled as 00h." begin="31" end="8" width="24" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCOFFTRIM_LITE_" width="32" offset="0x10E8" description="ADC Offset Trim Register 1">
        <bitfield id="OFFTRIM" description="ADC Offset Trim #br# #br#Adjusts the conversion results of the converter up #br#or down to account for offset error in the ADC. A factory trim setting will be loaded during device boot. #br# #br#Offset can be corrected in the range of +7 to -8 LSBs. Value is 16*Offset in 8-bit 2's complement: #br# #br#7 LSB (16*7) = 112 #br#6 LSB (16*6) = 96 #br#5 LSB (16*5) = 80 #br#4 LSB (16*4) = 64 #br#3 LSB (16*3) = 48 #br#2 LSB (16*2) = 32 #br#1 LSB (16*1) = 16 #br#0 LSB (16*0) = 0 #br#-1 LSB (16*(-1)) = 240 #br#: #br#: #br#-7LSB(16*(-7)) = 144" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
