ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC0_0.0.xml
    <register id="HSADC0_REP1N_LITE_" width="32" offset="0x11C4" description="ADC Trigger Repeater 1 N Select Register">
        <bitfield id="NSEL" description="ADC Trigger Repeater 1 selection of number of triggers. #br# #br#In oversampling mode, selects the number of repeated triggers. For each trigger received corresponding to REP1CTL.TRIGSEL, 2^NSEL triggers will be generated.   #br# #br#0 = 1 trigger is generated (pass-through) #br#1 = 2 triggers are generated #br#2 = 4 triggers are generated #br#3 = 8 triggers are generated  #br# #br#In undersampling mode, selects the number triggers to be supressed. 1 out NSEL + 1 triggers received corresponding to REP1CTL.TRIGSEL will be passed through (the first trigger will be passed through and the subsequent NSEL triggers will be supressed).   #br# #br#0 = all triggers are passed #br#1 = 1 out of 2 triggers are passed #br#2 = 1 out of 3 triggers are passed #br#... #br#127 = 1 out of 128 triggers are passed" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="NCOUNT" description="ADC trigger repeater 1 trigger count.   #br# #br#Indicates the number of triggers remaining to be generated.  If a trigger is received corresponding to REP1CTL.TRIGSEL while NCOUNT is not 0 (the repeater is still busy generating the repeated triggers) then the trigger will be ignored and REP1CTL.TRIGOVF will be set to 1." begin="18" end="16" width="3" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_REP1PHASE" width="32" offset="0x11C8" description="ADC Trigger Repeater 1 Phase Select Register">
        <bitfield id="PHASE" description="ADC trigger repeater 1 phase delay configuration.  Defines the number of SYSCLKs to delay the selected trigger before passing it on to the re-triggering logic.   #br# #br#0 = trigger is passed through without delay #br#1 = trigger is delayed by 1 SYSCLK #br#2 = trigger is delayed by 2 SYSCLKs #br#... #br#65535 = trigger is delayed by 65535 SYSCLKs" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
        <bitfield id="PHASECOUNT" description="ADC trigger repeater 1 phase delay status.  When the trigger selected by REP1CTL.TRIGSEL is received, this register will start counting down from PHASECOUNT until the counter reaches 0, at which point the trigger will be passed on to the repeater re-trigger logic.  #br# #br#If the trigger selected by REP1CTL.TRIGSEL is recieved when PHASECOUNT is not 0 (the phase delay logic is busy from the previous trigger) then the new trigger will be ignored and REP1CTL.PHASEOVF will be set to 1." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_REP1SPREAD" width="32" offset="0x11CC" description="ADC Trigger Repeater 1 Spread Select Register">
        <bitfield id="SPREAD" description="ADC trigger repeater 1 spread delay configuration.  In oversampling mode, defines the minimum number of SYSCLKs to wait before creating the next repeated trigger to the ADC.   #br# #br#If SPREAD is less than the time needed for all SOCs associated with repeater 1 to sample and convert, then the repeater will generate triggers as fast as the ADC can convert the associated conversions. #br# #br#If SPREAD is greater than the time needed for all SOCs associated with repeater 1 to sample and convert, then repeated triggers to the ADC will be SPREAD SYSCLK cycles apart.   #br# #br#0 = oversampled repeated triggers occur as fast as the ADC can sample and convert associated SOCs #br#1 = time between repeated triggers is at least 1 SYSCLKs #br#2 = time between repeated triggers is at least 2 SYSCLKs #br#... #br#65535 =  time between repeated triggers is at least 65535 SYSCLKs" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
        <bitfield id="SPREADCOUNT" description="ADC trigger repeater 1 spread status.  When a trigger is sent to the ADC in oversampling mode, this register will start counting down from SPREAD until SPREADCOUNT equals 0.   #br# #br#The next repeated trigger to the ADC in oversampling mode will not occur until SPREADCOUNT is 0 (minimum time is complete) and REP1CTL.BUSY = 0 (SOCs associated with trigger repeater 1 are no longer pending)." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_REP1FRC_LITE_" width="32" offset="0x11D0" description="ADC Trigger Repeater 1 Software Force Register">
        <bitfield id="SWFRC" description="Write 1 to force a trigger to repeat block 1 input regardless of the value of TRIGGER. #br# #br#Always reads 0." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_REP2CTL_LITE_" width="32" offset="0x11E0" description="ADC Trigger Repeater 2 Control Register">
        <bitfield id="MODE" description="ADC trigger repeater 2 mode selection.  Select either oversampling or undersampling mode.   #br# #br#In oversampling mode, when the trigger selected by REP2CTL.TRIGSEL is received, the repeater will repeat the trigger REP2N.NSEL + 1 times. #br# #br#In undersampling mode, when the trigger selected by REP2CTL.TRIGSEL is received the first time, the repeater will pass the trigger through.  The next REP2N.NSEL triggers will be ignored.   #br# #br#0 = oversampling #br#1 = undersampling" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ACTIVEMODE" description="When a trigger is recived in oversampling or undersampling mode the value of MODE is copied to ACTIVEMODE.  ACTIVEMODE determines if the repeater will repeat of filter triggers.  Changes to MODE while the repeater is working therefore won't cause any changes in functionality until the module becomes idle and then a new trigger is received.  #br# #br#0 = module is oversampling #br#1 = module is undersampling" begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="MODULEBUSY" description="ADC Trigger Repeater 2 Module Busy indicator.  In oversampling mode: #br# #br#0 = Repeater 2 is idle and can accept a new repeated trigger in oversampling mode #br#1 = Repeater 2 still has repeated triggers remaining (NCOUNT &gt; 0) or associated SOCs are still pending (SOCBUSY is 1) #br# #br#If a new oversampled trigger is received while the module is still busy, the TRIGGEROVF bit will be set and the trigger will be ignored." begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOCBUSY" description="ADC Trigger Repeater 2 Associated SOCs Busy indicator.  In oversampling mode: #br# #br#0 = no SOCs associated with this repeater are pending #br#1 = SOCs associated with this repeater are still pending #br# #br#The next repeated trigger to the ADC in oversampling mode will not occur until SPREADCOUNT is 0 (minimum time is complete) and REP2CTL.BUSY = 0 (SOCs associated with trigger repeater 2 are no longer pending). #br# #br#Note: If the ADC is in burstmode and the BURSTTRIG is Repeater 2, then all round-robin SOCs are considered associated with this repeater and the repeater will not re-trigger until there are no pending round-robin SOCs (in addition to any associated pending high-priority SOCs)." begin="4" end="4" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PHASEOVF" description="ADC Trigger Repeater 2 Phase Delay Overflow. #br# #br#Indicates that a trigger was dropped because a trigger arrived when the phase delay logic was still waiting to send the delayed trigger (PHASECOUNT was not 0).   #br# #br#Writing a 1 will clear this flag. #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TRIGGEROVF" description="ADC Trigger Repeater 2 Oversampled Trigger Overflow. #br# #br#Indicates that a trigger was dropped because a trigger arrived while the repeater was still generating repeated oversampled triggers (NCOUNT was not 0 or SOCs associated with Repeater 2 were still pending).   #br# #br#Writing a 1 will clear this flag. #br# #br#Note: This flag won't be set in undersampling mode or when NSEL = 0; if a trigger arrives before the previous SOCs have completed, the trigger will be passed and the overflow flags of the SOCs that were still pending will be set.  #br# #br#Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will remain set." begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TRIGGER" description="ADC Trigger Repeater 2 Trigger Select.  Selects the trigger to modify via oversampling or undersampling. #br# #br#  00h  REPTRIG0 - Software only #br#  01h-1FH   Hardware triggers" begin="12" end="8" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="SYNCINSEL" description="Trigger repeater 2 sync. input select.  On a sync. event, all registers in repeater 2 are reset to a ready and waiting state.  Values of NSEL, PHASE, and MODE are preserved. #br# #br#Note: SOCs associated with repeater 2 are not cleared.   #br# #br#0h = Disable Syncin to Repeater 2 #br#1h  - 1Fh  = Hardware syncin sources" begin="18" end="16" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="SWSYNC" description="Trigger repeater 2 software force sync.  On a sync. event, all registers in repeater 2 are reset to a ready and waiting state.  Values of NSEL, PHASE, and MODE are preserved.   #br# #br#Note: SOCs associated with repeater 2 are not cleared." begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_REP2N_LITE_" width="32" offset="0x11E4" description="ADC Trigger Repeater 2 N Select Register">
        <bitfield id="NSEL" description="ADC Trigger Repeater 2 selection of number of triggers. #br# #br#In oversampling mode, selects the number of repeated triggers. For each trigger received corresponding to REP2CTL.TRIGSEL, 2^NSEL triggers will be generated.   #br# #br#0 = 1 trigger is generated (pass-through) #br#1 = 2 triggers are generated #br#2 = 4 triggers are generated #br#3 = 8 triggers are generated  #br# #br#In undersampling mode, selects the number triggers to be supressed. 1 out NSEL + 1 triggers received corresponding to REP2CTL.TRIGSEL will be passed through (the first trigger will be passed through and the subsequent NSEL triggers will be supressed).   #br# #br#0 = all triggers are passed #br#1 = 1 out of 2 triggers are passed #br#2 = 1 out of 3 triggers are passed #br#... #br#127 = 1 out of 128 triggers are passed" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="NCOUNT" description="ADC trigger repeater 2 trigger count.   #br# #br#Indicates the number of triggers remaining to be generated.  If a trigger is received corresponding to REP2CTL.TRIGSEL while NCOUNT is not 0 (the repeater is still busy generating the repeated triggers) then the trigger will be ignored and REP2CTL.TRIGOVF will be set to 1." begin="18" end="16" width="3" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_REP2PHASE" width="32" offset="0x11E8" description="ADC Trigger Repeater 2 Phase Select Register">
        <bitfield id="PHASE" description="ADC trigger repeater 2 phase delay configuration.  Defines the number of SYSCLKs to delay the selected trigger before passing it on to the re-triggering logic.   #br# #br#0 = trigger is passed through without delay #br#1 = trigger is delayed by 1 SYSCLK #br#2 = trigger is delayed by 2 SYSCLKs #br#... #br#65535 = trigger is delayed by 65535 SYSCLKs" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
        <bitfield id="PHASECOUNT" description="ADC trigger repeater 2 phase delay status.  When the trigger selected by REP2CTL.TRIGSEL is received, this register will start counting down from PHASECOUNT until the counter reaches 0, at which point the trigger will be passed on to the repeater re-trigger logic.  #br# #br#If the trigger selected by REP2CTL.TRIGSEL is recieved when PHASECOUNT is not 0 (the phase delay logic is busy from the previous trigger) then the new trigger will be ignored and REP2CTL.PHASEOVF will be set to 1." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_REP2SPREAD" width="32" offset="0x11EC" description="ADC Trigger Repeater 2 Spread Select Register">
        <bitfield id="SPREAD" description="ADC trigger repeater 2 spread delay configuration.  In oversampling mode, defines the minimum number of SYSCLKs to wait before creating the next repeated trigger to the ADC.   #br# #br#If SPREAD is less than the time needed for all SOCs associated with repeater 2 to sample and convert, then the repeater will generate triggers as fast as the ADC can convert the associated conversions. #br# #br#If SPREAD is greater than the time needed for all SOCs associated with repeater 2 to sample and convert, then repeated triggers to the ADC will be SPREAD SYSCLK cycles apart.   #br# #br#0 = oversampled repeated triggers occur as fast as the ADC can sample and convert associated SOCs #br#1 = time between repeated triggers is at least 1 SYSCLKs #br#2 = time between repeated triggers is at least 2 SYSCLKs #br#... #br#65535 =  time between repeated triggers is at least 65535 SYSCLKs" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
        <bitfield id="SPREADCOUNT" description="ADC trigger repeater 2 spread status.  When a trigger is sent to the ADC in oversampling mode, this register will start counting down from SPREAD until SPREADCOUNT equals 0.   #br# #br#The next repeated trigger to the ADC in oversampling mode will not occur until SPREADCOUNT is 0 (minimum time is complete) and REP2CTL.BUSY = 0 (SOCs associated with trigger repeater 2 are no longer pending)." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_REP2FRC_LITE_" width="32" offset="0x11F0" description="ADC Trigger Repeater 2 Software Force Register">
        <bitfield id="SWFRC" description="Write 1 to force a trigger to repeat block 2 input regardless of the value of TRIGGER. #br# #br#Always reads 0." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB1LIMIT_LITE_" width="32" offset="0x1200" description="ADC PPB1Conversion Count Limit Register">
        <bitfield id="LIMIT" description="Post Processing Block 1 Oversampling Limit.  Defines the number of conversions to accumulate before PSUM is automatically loaded into SUM.   #br# #br#0 = No - accumulation #br#1 = 2 conversions are accumulated #br#2 = 4 conversions are accumulated #br#3 = 8 conversions are accumulated  #br#" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB1PCOUNT_LITE_" width="32" offset="0x1204" description="ADC PPB1 Partial Conversion Count Register">
        <bitfield id="PCOUNT" description="Post Processing Block 1 Oversampling Partial Count.  Each time a new result propagates through the PPB signal chain and accumulates into ADCPPB1PSUM this register is incremented by 1.   #br# #br#This register is reset when either a count-match event occurs (PCOUNT = LIMIT) or PPB1 receives a sync. event. #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB1RESULT timing information)." begin="2" end="0" width="3" rwaccess="R">
        </bitfield>
    </register>
