ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC0_0.0.xml
    <register id="HSADC0_ADCSEQ3CONFIG" width="32" offset="0x132C" description="ADC Sequencer 3 Config register">
        <bitfield id="ACQPS" description="SOC3 Acquisition Prescale. Controls the sample and hold window for each SOC in this Seqeunce. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration. #br#S+H window values is defined based on a combonation of ACQPS[7:6]  and ACQPS[5:0] values #br#If ACQPS[7:6] value is #br#  &amp;quot;00&amp;quot; S+H window = ACQPS[5:0] + 1 sysclk cycles #br#  &amp;quot;01&amp;quot;  S+H window = 64 + ((ACQPS[5:0] +1) * 2) sysclk cycles #br#  &amp;quot;10&amp;quot;  S+H window = 192 + ((ACQPS[5:0] +1) * 4) sysclk cycles #br#  &amp;quot;11&amp;quot;  S+H window = 448 + ((ACQPS[5:0] +1) * 16) sysclk cycles" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="SAMPCAPRESETDISABLE" description="SOC3 Sample Cap Reset enable : Resets sample cap after conversion. #br#0 - The sample cap is reset after each conversion #br#1 - The sample cap is not reset after each conversion" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SAMPCAPRESETSEL" description="SOC3 Sample Cap Reset Select : Resets sample cap after conversion to either vrefhi/2 or vreflo #br#0 - The sample cap is reset to Vreflo after each conversion #br#1 - The sample cap is reset to Vrefhi/2 after each conversion" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQSTART" description="Beginning SOC of SEQ3" begin="18" end="15" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="TRIGSEL" description="SOC3 Trigger Source Select. Along with the SOC3 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC3 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it. #br# #br#Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration. #br#  0h  ADCTRIG0 - Software only #br#  1h - 7h  Hardware triggers" begin="22" end="20" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQSWFRC" description="Write 1 to force a trigger to Sequencer 3 regardless of the value of Hardware TRIGGER. #br# #br#Always reads 0." begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQENABLE" description="SEQ3Enable #br#Indicates whether the Sequence3 is enabled or not" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSEQ4CONFIG" width="32" offset="0x1330" description="ADC Sequencer 4 Config register">
        <bitfield id="ACQPS" description="SOC4 Acquisition Prescale. Controls the sample and hold window for each SOC in this Seqeunce. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration. #br#S+H window values is defined based on a combonation of ACQPS[7:6]  and ACQPS[5:0] values #br#If ACQPS[7:6] value is #br#  &amp;quot;00&amp;quot; S+H window = ACQPS[5:0] + 1 sysclk cycles #br#  &amp;quot;01&amp;quot;  S+H window = 64 + ((ACQPS[5:0] +1) * 2) sysclk cycles #br#  &amp;quot;10&amp;quot;  S+H window = 192 + ((ACQPS[5:0] +1) * 4) sysclk cycles #br#  &amp;quot;11&amp;quot;  S+H window = 448 + ((ACQPS[5:0] +1) * 16) sysclk cycles" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="SAMPCAPRESETDISABLE" description="SOC4 Sample Cap Reset enable : Resets sample cap after conversion. #br#0 - The sample cap is reset after each conversion #br#1 - The sample cap is not reset after each conversion" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SAMPCAPRESETSEL" description="SOC4 Sample Cap Reset Select : Resets sample cap after conversion to either vrefhi/2 or vreflo #br#0 - The sample cap is reset to Vreflo after each conversion #br#1 - The sample cap is reset to Vrefhi/2 after each conversion" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQSTART" description="Beginning SOC of SEQ4" begin="18" end="15" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="TRIGSEL" description="SOC4 Trigger Source Select. Along with the SOC4 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC4 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it. #br# #br#Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration. #br#  0h  ADCTRIG0 - Software only #br#  1h - 7h  Hardware triggers" begin="22" end="20" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQSWFRC" description="Write 1 to force a trigger to Sequencer 4 regardless of the value of Hardware TRIGGER. #br# #br#Always reads 0." begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQENABLE" description="SEQ4Enable #br#Indicates whether the Sequence4 is enabled or not" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="HSADC0_ADCRESULT0_12B_M33" width="16" offset="0x5000" description="ADC Result 0 Register">
    </register>
    <register id="HSADC0_ADCRESULT1_12B_M33" width="16" offset="0x5002" description="ADC Result 1 Register">
    </register>
    <register id="HSADC0_ADCRESULT2_12B_M33" width="16" offset="0x5004" description="ADC Result 2 Register">
    </register>
    <register id="HSADC0_ADCRESULT3_12B_M33" width="16" offset="0x5006" description="ADC Result 3 Register">
    </register>
    <register id="HSADC0_ADCRESULT4_12B_M33" width="16" offset="0x5008" description="ADC Result 4 Register">
    </register>
    <register id="HSADC0_ADCRESULT5_12B_M33" width="16" offset="0x500A" description="ADC Result 5 Register">
    </register>
    <register id="HSADC0_ADCRESULT6_12B_M33" width="16" offset="0x500C" description="ADC Result 6 Register">
    </register>
