ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC0_0.0.xml
    <register id="HSADC0_ADCRESULT7_12B_M33" width="16" offset="0x500E" description="ADC Result 7 Register">
    </register>
    <register id="HSADC0_ADCRESULT8_12B_M33" width="16" offset="0x5010" description="ADC Result 8 Register">
    </register>
    <register id="HSADC0_ADCRESULT9_12B_M33" width="16" offset="0x5012" description="ADC Result 9 Register">
    </register>
    <register id="HSADC0_ADCRESULT10_12B_M33" width="16" offset="0x5014" description="ADC Result 10 Register">
    </register>
    <register id="HSADC0_ADCRESULT11_12B_M33" width="16" offset="0x5016" description="ADC Result 11 Register">
    </register>
    <register id="HSADC0_ADCRESULT12_12B_M33" width="16" offset="0x5018" description="ADC Result 12 Register">
    </register>
    <register id="HSADC0_ADCRESULT13_12B_M33" width="16" offset="0x501A" description="ADC Result 13 Register">
    </register>
    <register id="HSADC0_ADCRESULT14_12B_M33" width="16" offset="0x501C" description="ADC Result 14 Register">
    </register>
    <register id="HSADC0_ADCRESULT15_12B_M33" width="16" offset="0x501E" description="ADC Result 15 Register">
    </register>
    <register id="HSADC0_ADCPPB1RESULT_12B_" width="32" offset="0x5040" description="ADC Post Processing Block 1 Result Register">
        <bitfield id="PPBRESULT" description="ADC Post Processing Block Result 1 #br# #br#The result of the offset/reference subtraction post conversion processing is stored in this register.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 1 SYSCLK cycle after the associated ADCRESULT and subsequent results (in order from lowest numbered PPB to highest) will each become available every 2-3 SYSCLK cycles (refer to the TRM for more detailed timing information).  #br# #br#If ADCINTFLG is polled to determine when to read the PPBRESULT, it may be necessary to add one or more NOP instructions to ensure that the updated post conversion processing result has posted to the register. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." begin="12" end="0" width="13" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 12. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." begin="31" end="13" width="19" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB2RESULT_12B_" width="32" offset="0x5044" description="ADC Post Processing Block 2 Result Register">
        <bitfield id="PPBRESULT" description="ADC Post Processing Block Result 2 #br# #br#The result of the offset/reference subtraction post conversion processing is stored in this register.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 1 SYSCLK cycle after the associated ADCRESULT and subsequent results (in order from lowest numbered PPB to highest) will each become available every 2-3 SYSCLK cycles (refer to the TRM for more detailed timing information).  #br# #br#If ADCINTFLG is polled to determine when to read the PPBRESULT, it may be necessary to add one or more NOP instructions to ensure that the updated post conversion processing result has posted to the register. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." begin="12" end="0" width="13" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 12. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." begin="31" end="13" width="19" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB3RESULT_12B_" width="32" offset="0x5048" description="ADC Post Processing Block 3 Result Register">
        <bitfield id="PPBRESULT" description="ADC Post Processing Block Result 3 #br# #br#The result of the offset/reference subtraction post conversion processing is stored in this register.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 1 SYSCLK cycle after the associated ADCRESULT and subsequent results (in order from lowest numbered PPB to highest) will each become available every 2-3 SYSCLK cycles (refer to the TRM for more detailed timing information).  #br# #br#If ADCINTFLG is polled to determine when to read the PPBRESULT, it may be necessary to add one or more NOP instructions to ensure that the updated post conversion processing result has posted to the register. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." begin="12" end="0" width="13" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 12. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." begin="31" end="13" width="19" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB4RESULT_12B_" width="32" offset="0x504C" description="ADC Post Processing Block 4 Result Register">
        <bitfield id="PPBRESULT" description="ADC Post Processing Block Result 4 #br# #br#The result of the offset/reference subtraction post conversion processing is stored in this register.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 1 SYSCLK cycle after the associated ADCRESULT and subsequent results (in order from lowest numbered PPB to highest) will each become available every 2-3 SYSCLK cycles (refer to the TRM for more detailed timing information).  #br# #br#If ADCINTFLG is polled to determine when to read the PPBRESULT, it may be necessary to add one or more NOP instructions to ensure that the updated post conversion processing result has posted to the register. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." begin="12" end="0" width="13" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 12. #br# #br#NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." begin="31" end="13" width="19" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB1SUM_LITE_" width="32" offset="0x5050" description="ADC PPB 1 Final Sum Result Register">
        <bitfield id="SUM" description="Post Processing Block 1 Oversampling Final Sum. When either a count-match event occurs (PCOUNT = LIMIT) or PPB1 receives a sync. event, the value of PSUM is loaded into this register.  In the case of a count-match event, the sum loaded into this register includes the value from the most recent conversion.  #br# #br#The value from PSUM will be right shifted by the amount specified in the SHIFT register before being loaded into the final SUM result register. #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB1RESULT timing information)." begin="15" end="0" width="16" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 15." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
