ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC0_0.0.xml
    <register id="HSADC0_ADCPPB1MINI" width="16" offset="0x507C" description="ADC PPB 1 Final Min Index Result Register">
        <bitfield id="MINI" description="Post Processing Block 1 Oversampling Final Index of the Min. When either a count-match event occurs (PCOUNT = LIMIT) or PPB1 receives a sync. event, the value of PMINI is loaded into this register.  In the case of a count-match event, the min index loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB1RESULT timing information)." begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB2MAX" width="32" offset="0x5080" description="ADC PPB 2 Final Max Result Register">
        <bitfield id="MAX" description="Post Processing Block 2 Oversampling Final Max. When either a count-match event occurs (PCOUNT = LIMIT) or PPB2 receives a sync. event, the value of PMAX is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available (only when a count-match event occurs).  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB2RESULT timing information)." begin="16" end="0" width="17" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 16." begin="31" end="17" width="15" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB2MAXI" width="16" offset="0x5084" description="ADC PPB 2 Final Max Index Result Register">
        <bitfield id="MAXI" description="Post Processing Block 2 Oversampling Final Index of the Max. When either a count-match event occurs (PCOUNT = LIMIT) or PPB2 receives a sync. event, the value of PMAXI is loaded into this register.  In the case of a count-match event, the max index loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB2RESULT timing information)." begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB2MIN" width="32" offset="0x5088" description="ADC PPB 2 Final Min Result Register">
        <bitfield id="MIN" description="Post Processing Block 2 Oversampling Final Min. When either a count-match event occurs (PCOUNT = LIMIT) or PPB2 receives a sync. event, the value of PMIN is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB2RESULT timing information)." begin="16" end="0" width="17" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 16." begin="31" end="17" width="15" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB2MINI" width="16" offset="0x508C" description="ADC PPB 2 Final Min Index Result Register">
        <bitfield id="MINI" description="Post Processing Block 2 Oversampling Final Index of the Min. When either a count-match event occurs (PCOUNT = LIMIT) or PPB2 receives a sync. event, the value of PMINI is loaded into this register.  In the case of a count-match event, the min index loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB2RESULT timing information)." begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB3MAX" width="32" offset="0x5090" description="ADC PPB 3 Final Max Result Register">
        <bitfield id="MAX" description="Post Processing Block 3 Oversampling Final Max. When either a count-match event occurs (PCOUNT = LIMIT) or PPB3 receives a sync. event, the value of PMAX is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available (only when a count-match event occurs).  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB3RESULT timing information)." begin="16" end="0" width="17" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 16." begin="31" end="17" width="15" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB3MAXI" width="16" offset="0x5094" description="ADC PPB 3 Final Max Index Result Register">
        <bitfield id="MAXI" description="Post Processing Block 3 Oversampling Final Index of the Max. When either a count-match event occurs (PCOUNT = LIMIT) or PPB3 receives a sync. event, the value of PMAXI is loaded into this register.  In the case of a count-match event, the max index loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB3RESULT timing information)." begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB3MIN" width="32" offset="0x5098" description="ADC PPB 3 Final Min Result Register">
        <bitfield id="MIN" description="Post Processing Block 3 Oversampling Final Min. When either a count-match event occurs (PCOUNT = LIMIT) or PPB3 receives a sync. event, the value of PMIN is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB3RESULT timing information)." begin="16" end="0" width="17" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 16." begin="31" end="17" width="15" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB3MINI" width="16" offset="0x509C" description="ADC PPB 3 Final Min Index Result Register">
        <bitfield id="MINI" description="Post Processing Block 3 Oversampling Final Index of the Min. When either a count-match event occurs (PCOUNT = LIMIT) or PPB3 receives a sync. event, the value of PMINI is loaded into this register.  In the case of a count-match event, the min index loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB3RESULT timing information)." begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB4MAX" width="32" offset="0x50A0" description="ADC PPB 4 Final Max Result Register">
        <bitfield id="MAX" description="Post Processing Block 4 Oversampling Final Max. When either a count-match event occurs (PCOUNT = LIMIT) or PPB4 receives a sync. event, the value of PMAX is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available (only when a count-match event occurs).  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB4RESULT timing information)." begin="16" end="0" width="17" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 16." begin="31" end="17" width="15" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB4MAXI" width="16" offset="0x50A4" description="ADC PPB 4 Final Max Index Result Register">
        <bitfield id="MAXI" description="Post Processing Block 4 Oversampling Final Index of the Max. When either a count-match event occurs (PCOUNT = LIMIT) or PPB4 receives a sync. event, the value of PMAXI is loaded into this register.  In the case of a count-match event, the max index loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB4RESULT timing information)." begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB4MIN" width="32" offset="0x50A8" description="ADC PPB 4 Final Min Result Register">
        <bitfield id="MIN" description="Post Processing Block 4 Oversampling Final Min. When either a count-match event occurs (PCOUNT = LIMIT) or PPB4 receives a sync. event, the value of PMIN is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB4RESULT timing information)." begin="16" end="0" width="17" rwaccess="R">
        </bitfield>
        <bitfield id="SIGN" description="Sign Extended Bits. These bits reflect the same value as bit 16." begin="31" end="17" width="15" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCPPB4MINI" width="16" offset="0x50AC" description="ADC PPB 4 Final Min Index Result Register">
        <bitfield id="MINI" description="Post Processing Block 4 Oversampling Final Index of the Min. When either a count-match event occurs (PCOUNT = LIMIT) or PPB4 receives a sync. event, the value of PMINI is loaded into this register.  In the case of a count-match event, the min index loaded into this register includes the value from the most recent conversion.  #br# #br#This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available (only in case of a count-match event). This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB4RESULT timing information)." begin="9" end="0" width="10" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSEQ1FIFORESULT" width="32" offset="0x50C0" description="ADC Sequence 1 FIFO Result Register">
    </register>
    <register id="HSADC0_ADCSEQ2FIFORESULT" width="32" offset="0x50C4" description="ADC Sequence 2 FIFO Result Register">
    </register>
