ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/ADC0_0.0.xml
    <register id="HSADC0_ADCSEQ3FIFORESULT" width="32" offset="0x50C8" description="ADC Sequence 3 FIFO Result Register">
    </register>
    <register id="HSADC0_ADCSEQ4FIFORESULT" width="32" offset="0x50CC" description="ADC Sequence 4 FIFO Result Register">
    </register>
    <register id="HSADC0_ADCSEQ1FIFOSTATUS" width="32" offset="0x50D0" description="ADC Sequence 1 FIFO Status">
        <bitfield id="SEQFIFOVALID" description="Sequencer 1 FIFO Valid #br#0 -  All Conversions associated with the current Sequencer are NOT complete. #br#1 - Conversion from all the SOCs associated with the Sequencer are complete and result is available to be read." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SEQFIFOPENDREAD" description="Sequencer 1 FIFO pending reads #br#Note:  #br#1. This field is only updated when after the last byte of ADCSEQ1FIFORESULT is read. #br#2. The Pending read information will not be updated for debug reads.  #br#3. Once all the data in the FIFO has been read, FIFO will wrap back. Subsequent reads will read from the beginning of the FIFO." begin="4" end="1" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSEQ2FIFOSTATUS" width="32" offset="0x50D4" description="ADC Sequence 2 FIFO Status">
        <bitfield id="SEQFIFOVALID" description="Sequencer 2 FIFO Valid #br#0 -  All Conversions associated with the current Sequencer are NOT complete. #br#1 - Conversion from all the SOCs associated with the Sequencer are complete and result is available to be read." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SEQFIFOPENDREAD" description="Sequencer 2 FIFO pending reads #br#Note:  #br#1. This field is only updated when after the last byte of ADCSEQ2FIFORESULT is read. #br#2. The Pending read information will not be updated for debug reads.  #br#3. Once all the data in the FIFO has been read, FIFO will wrap back. Subsequent reads will read from the beginning of the FIFO." begin="4" end="1" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSEQ3FIFOSTATUS" width="32" offset="0x50D8" description="ADC Sequence 3 FIFO Status">
        <bitfield id="SEQFIFOVALID" description="Sequencer 3 FIFO Valid #br#0 -  All Conversions associated with the current Sequencer are NOT complete. #br#1 - Conversion from all the SOCs associated with the Sequencer are complete and result is available to be read." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SEQFIFOPENDREAD" description="Sequencer 3 FIFO pending reads #br#Note:  #br#1. This field is only updated when after the last byte of ADCSEQ3FIFORESULT is read. #br#2. The Pending read information will not be updated for debug reads.  #br#3. Once all the data in the FIFO has been read, FIFO will wrap back. Subsequent reads will read from the beginning of the FIFO." begin="4" end="1" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="HSADC0_ADCSEQ4FIFOSTATUS" width="32" offset="0x50DC" description="ADC Sequence 4 FIFO Status">
        <bitfield id="SEQFIFOVALID" description="Sequencer 4 FIFO Valid #br#0 -  All Conversions associated with the current Sequencer are NOT complete. #br#1 - Conversion from all the SOCs associated with the Sequencer are complete and result is available to be read." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SEQFIFOPENDREAD" description="Sequencer 4 FIFO pending reads #br#Note:  #br#1. This field is only updated when after the last byte of ADCSEQ4FIFORESULT is read. #br#2. The Pending read information will not be updated for debug reads.  #br#3. Once all the data in the FIFO has been read, FIFO will wrap back. Subsequent reads will read from the beginning of the FIFO." begin="4" end="1" width="4" rwaccess="R">
        </bitfield>
    </register>

</module>